{"transcript": {"text": "in this video we're gonna talk about Simpsons paradox this is a fascinating statistical paradox that causes a lot of problems in the ways we think about and report on all sorts of statistics and society for example the survivability of Cova 19 so let me illustrate this with an example I'm gonna compare China and Italy Italy was one of the initial countries in the Cova 19 pandemic they have a huge spike in cases after it left China and I'm gonna focus on something called this CF r or case fatality rate basically this says if you have kovat 19 what are your chances of surviving this particular disease now it turns out that when you look at all the cases that I'm going to focus on a period between early March and late May we look at all the cases in China and all the cases in Italy is a clear pattern you are more likely to survive in China than you are in Italy and you can wonder why that might be the case or even question the reliability of that data but nevertheless let's take that as a fact for this video you're more likely to survive in China than you are in Italy however it turns out that if you dig a little bit deeper a very different type of relationship appears in this chart I am breaking down the CFR rate based on different age groups so I'm looking at 20 year olds 30 year olds four year olds 50 year olds and so on every 10 years and if you look at any one of those age range takes a 60 year olds it turns out that 60 year olds in Italy who have Cova 19 or more likely survive than 60 year olds in China who have Cova 19 same for seven year olds same for 80 year olds same for 20 year olds in every different age bucket you're more likely to survive if you get the disease in Italy than you are in China and yet overall when you put the total here when you aggregate it all up it's better off to be in China than it is in Italy so how can that be how can in every possible age bucket it'd be better in Italy yet overall and be better in China so I actually encourage you to pause the video and see if you can figure out what a reason for that might be alright if you've got that wonderful you're an excellent statistician but if you're just here to enjoy show then the answer is about age demographics this chart shows the breakdown in terms of age it shows the percentage of the total patients who are in any different age range and what we see here is that in Italy there is a higher proportion of older patients patients in their 80s and 70s than there are younger patients patients and say their 30s or 40s and this matters a lot because one of the key features of kovat 19 is that it is much easier to survive if you are younger than if you are older so the fact that Italy has this higher proportion of older patients who have gotten Cova 19 means their survivability rates are pulled down because of this phenomena so even though they're doing a relatively good job among any individual age group that they have more of the higher risk age groups in their overall profile causes a problem and that's the core idea of Simpsons paradox since this paradox is when the trend for aggregate data when you put everything together is different from the trend when you go in so divided into different categories and you look within each category and that's exactly what's happened here now I actually just made up some data just to illustrate the point even more clearly this is just some arbitrary made-up horizontal axis some made up vertical axis and if you just looked at this data well what do you think the trend is if I wasn't thinking about Simpsons paradox at all I might just look at this and think well it's too generally a downward trend as you increase in the horizontal you go down in the vertical I could plot a trend line here it looks like a somewhat decent trend line is kind of convincing but this data actually comes from three different categories and I'll just color code it to illustrate those different categories well that looks very different in each of these three colors it looks like an upwards trend and we have these upward trend lines these three categories would be like for example three different countries or three different states depends on what it is they're actually measuring but nevertheless the key message here is when you aggregate data over a lot of different categories the trend can appear to be one thing but that when you divide it into categories that trend is actually something very different this is a very important thing to keep in mind whenever you see statistics about pretty much any phenomenon for example right now I'm recording in early July but when you look back a few weeks into June of 2020 and the Kouga 19 pandemic particularly in the United States if you just looked at the countrywide statistics you might think that actually things are just kind of flatlining they're not getting much worse or much better but if you look at the level of individual states there's big states like New York and New Jersey where the cases were going down well other states like Arizona or Texas had their cases going up and so you might think okay everything's sort of stable but not realizing that when you zoom in on individual states it's a very different picture and then now in early July we see that the answer has been there's been massive growth in it now a wide swath of states that are seeing a little bit earlier but only if you look at the state level not the country level and indeed in statistics this is a very common problem what level of aggregation do you want to focus on if you put everything together on one bundle you may miss the true story for example with FinCEN's paradox as I've Illustrated in this video but if you zoom in too much and don't aggregate at all for example maybe you look at individual counties not staged or have individual people well you can't really say anything the data becomes too messy so let's toothpicks you're always wanting to aggregate to some degree so you can make some more meaningful trend lines appear but at the same time not aggregate so much that you lose the story you have to be very careful about what are the actual causal relationships to know where in that picture is appropriate to aggregate or not I once experienced a similar phenomenon in my own research in mathematics education I was doing this study where we had 23 different classes and about half of them were using active learning techniques where the students people to work together in groups and collaborate and in the other half the students were mainly just doing passive learning techniques like listening to an instructor lecture kind of like what you're doing right now and we looked at everything the general trend was that the active learning classes were doing better than the passive learning classes this is with the research and mathematics education in general order to be really convinced that that was the case I had to explore a particular confounding variable because turned out that students were not being randomly assigned into the different classrooms the way that it worked at the institution that I was doing this study was that an individual classroom was often highly populated based on the way that students registered by one particular program like one particular branch of engineering would all fit into one class because different branches within engineering had different competitiveness therefore the caliber of the student going into that work different it might mean that a classroom was doing better not because of the pedagogical techniques used but because it happened to be composed of students who generally had higher test scores this is the way the registration works it wasn't a random sampling and so what I had to do was make sure that even when you did this when you accounted for the different categorizations by different types of programs that there was still nevertheless a net positive benefit and indeed Simpsons paradox is most likely to occur in scenarios like that where there's not a randomized experiment there were structural difference between Italy and China there were structural differences between different states there are structural differences between the students in one classroom and the students in another classroom they're not just completely random variables and as a result of that those different categories can make big differences to the phenomenon that's being studied all right I hope you've enjoyed that video if you did please give a like because YouTube's place algorithm just as much as us mathematicians do a question about this video leave it down in the comments below and we're gonna do some more math in the next video", "confidence": 1.0}, "summary": "## Lecture Notes: Simpson's Paradox\n\n### I. Introduction\n\n*   Simpson's Paradox is a statistical phenomenon where a trend appears in different groups of data, but disappears or reverses when these groups are combined. This can lead to misinterpretations of data and incorrect conclusions.\n*   Understanding Simpson's Paradox is crucial for proper analysis and reporting of statistics, particularly in areas like healthcare, social sciences, and business.\n\n### II. Key Concepts\n\n*   **Case Fatality Rate (CFR):**  The proportion of people diagnosed with a disease who die from that disease.  It represents the risk of dying from a disease given that you have it.  Calculated as: (Number of deaths from disease) / (Number of cases of disease)\n*   **Aggregation:**  The process of combining data from different groups into a single dataset. This is often done to provide a summary overview.  However, aggregation can mask underlying trends and lead to Simpson's Paradox.\n*   **Confounding Variables:**  Variables that influence both the independent and dependent variables, causing a spurious association.  These variables can create the illusion of a causal relationship where none exists, or mask a true causal relationship. In Simpson's Paradox, uneven distribution of confounding variables across groups leads to the paradoxical effect.\n*   **Randomized Experiments:**  Experiments where subjects are randomly assigned to different treatment groups. This helps to eliminate the influence of confounding variables and provide a more accurate understanding of causal relationships.  The lack of randomization increases the likelihood of encountering Simpson's Paradox.\n\n\n### III. Example: COVID-19 Survival Rates\n\nThe lecturer uses the COVID-19 pandemic to illustrate Simpson's Paradox:\n\n*   **Initial Observation:**  Overall CFR data from early March to late May 2020 suggested a higher survival rate in China compared to Italy.\n*   **Deeper Dive:** Analyzing CFRs within specific age groups revealed the opposite trend.  Within each age bracket (20s, 30s, 40s, etc.), survival rates were consistently higher in Italy than in China.\n*   **Explanation:** The paradoxical observation arose from the differing age demographics between the two countries. Italy had a larger proportion of older patients, who are generally at higher risk of severe COVID-19 outcomes. This skewed the overall CFR for Italy upwards.  China, with a younger population of COVID-19 patients, had a lower overall CFR even though its age-specific CFRs were higher.\n\n### IV. Illustrative Example with Hypothetical Data\n\nThe lecturer provides a simplified example with made-up data to further clarify the concept.\n\n*   **Aggregated Data:** When viewed as a single dataset, the data points suggested a downward trend.\n*   **Categorized Data:** Dividing the data into three distinct categories revealed an upward trend within each category.  This illustrates how aggregating data can mask the true underlying trends within individual groups.\n\n### V. Simpson's Paradox in other Contexts\n\n*   **State-level vs. National-level COVID-19 data:** During June 2020, national-level data in the US suggested a plateau in COVID-19 cases. However, state-level data revealed declining cases in some states and rising cases in others, providing a more accurate picture of the pandemic's progression.\n*   **Mathematics Education Research:** The lecturer describes their own research experience, where active learning appeared more effective than passive learning overall.  However, non-random assignment of students to classrooms (with varying student caliber) introduced a confounding variable. Further analysis, controlling for the type of student program, was needed to confirm the benefits of active learning.\n\n### VI. Key Takeaways and Conclusions\n\n*   Simpson's Paradox highlights the importance of carefully considering the level of data aggregation.  Both over-aggregation and under-aggregation can lead to misleading conclusions.\n*   Understanding potential confounding variables is crucial for interpreting statistical trends accurately.  Unequal distribution of these variables across groups can produce Simpson's Paradox.\n*   Randomized experiments are the gold standard for establishing causal relationships, as they minimize the influence of confounding variables.  When randomization is not possible, careful analysis and control for confounding variables are necessary.\n*   Whenever presented with aggregated statistics, it is important to question the underlying data and consider potential subgroups or categories that might reveal a different story.  Always look deeper to understand the true nature of the trend.\n\n### VII. Further considerations\n\n*   **Data Visualization:** Appropriately visualizing data can help detect Simpson's Paradox. Plotting data at different levels of aggregation (e.g., both overall and by subgroups) can reveal discrepancies and highlight potential issues.\n*   **Statistical Techniques:**  Techniques like regression analysis, stratified analysis, and causal inference methods can help account for confounding variables and uncover true relationships within the data.\n\n\nThis comprehensive understanding of Simpson's Paradox is essential for anyone working with data analysis and interpretation, allowing for more informed decision-making and a more nuanced understanding of the world around us.\n", "notes": "## Lecture Notes: Simpson's Paradox\n\n### I. Introduction\n\n*   Simpson's Paradox is a statistical phenomenon where an observed trend in different groups of data reverses or disappears when these groups are combined.\n*   This paradox can lead to misinterpretations of data and inaccurate conclusions if not carefully considered.\n*   Understanding Simpson's Paradox is crucial for accurate data analysis and reporting, especially in fields like healthcare, social sciences, and business.\n\n### II. Key Concepts\n\n*   **Case Fatality Rate (CFR):** The proportion of people diagnosed with a disease who die from that disease. It represents the risk of mortality given infection.  Calculated as:  `(Number of deaths from disease) / (Number of cases of disease)`\n*   **Aggregation:**  The process of combining data from different groups into a single dataset. While useful for providing a general overview, aggregation can mask underlying trends and lead to Simpson's Paradox.\n*   **Confounding Variables:** These are variables that influence *both* the independent and dependent variables, creating a spurious association.  Confounding variables can either create the illusion of a causal relationship where none exists or hide a true causal link.  In Simpson's Paradox, the uneven distribution of confounding variables across groups causes the paradoxical effect.\n*   **Randomized Experiments:** Experiments where subjects are randomly assigned to different treatment groups. Randomization helps eliminate the influence of confounding variables, providing a clearer understanding of true causal relationships.  The lack of randomization increases the susceptibility to Simpson's Paradox.\n\n### III. Example: COVID-19 Survival Rates (March - May 2020)\n\nThe lecturer uses the COVID-19 pandemic to illustrate Simpson's Paradox:\n\n*   **Initial Observation (Aggregated Data):**  Overall CFR data suggested a higher survival rate in China compared to Italy.\n*   **Deeper Dive (Disaggregated Data):** Analyzing CFRs within specific age groups revealed the *opposite* trend. Within each age bracket (20s, 30s, 40s, etc.), survival rates were consistently higher in Italy than in China.\n*   **Explanation (Confounding Variable):**  The paradoxical observation resulted from differing age demographics. Italy had a significantly larger proportion of older patients, a known high-risk group for severe COVID-19 outcomes. This skewed the overall CFR for Italy upwards. China, with a younger COVID-19 patient population, had a lower overall CFR *despite* its age-specific CFRs being higher.  Age, therefore, acted as a confounding variable.\n\n### IV. Illustrative Example with Hypothetical Data\n\nThe lecturer uses a simplified example with fabricated data:\n\n*   **Aggregated Data:**  Viewing the data as a single set suggested a downward trend.\n*   **Categorized Data:** Dividing the data into three distinct categories revealed an *upward* trend within each category.\n*   **Takeaway:** This example demonstrates how aggregating data can obscure the true underlying trends present within individual subgroups.\n\n### V. Simpson's Paradox in Other Contexts\n\n*   **State-level vs. National-level COVID-19 Data (June 2020):** National-level data in the US suggested a plateau in COVID-19 cases. However, state-level data revealed both declining cases in some states and rising cases in others, painting a more accurate and nuanced picture of the pandemic's progression.  Here, the state becomes the subgroup, highlighting regional variations masked by national aggregation.\n*   **Mathematics Education Research:** The lecturer's own research experience highlighted the paradox. Active learning initially appeared more effective than passive learning overall. However, non-random assignment of students to classrooms (with varying student abilities) introduced a confounding variable – student caliber.  Further analysis, controlling for student program type, was necessary to draw valid conclusions about the effectiveness of active learning.  This emphasizes the importance of identifying and accounting for confounding variables.\n\n\n### VI. Key Takeaways and Conclusions\n\n*   **Aggregation Levels:**  Carefully consider the level of data aggregation. Both over-aggregation and under-aggregation can lead to misleading conclusions.  The appropriate level depends on the research question and potential confounders.\n*   **Confounding Variables:** Identifying and understanding potential confounding variables is essential for accurate interpretation. Uneven distribution of these variables across groups can produce Simpson's Paradox.\n*   **Randomized Experiments:** These are the gold standard for establishing causal relationships because they minimize the influence of confounding variables. When randomization is not feasible, careful analysis and statistical control for confounders are necessary.\n*   **Critical Thinking:**  Always question the underlying data of aggregated statistics. Consider potential subgroups or categories that might reveal a different story.  Look beyond the surface level for a deeper understanding of the true trends.\n\n### VII. Further Considerations\n\n*   **Data Visualization:** Appropriate visualization techniques can aid in detecting Simpson's Paradox. Plotting data at different aggregation levels (overall and by subgroups) can reveal discrepancies and highlight potential issues.  Scatter plots with color-coded categories can be particularly helpful.\n*   **Statistical Techniques:** Methods like regression analysis, stratified analysis, and causal inference techniques (e.g., matching, instrumental variables) can help account for confounding variables and uncover the true relationships within the data.\n\n\nUnderstanding Simpson's Paradox is crucial for anyone working with data analysis and interpretation. It allows for more informed decision-making and a more nuanced understanding of complex phenomena. By recognizing this paradox, we can avoid drawing erroneous conclusions and ensure a more rigorous approach to data analysis.\n", "flashcards": []}